apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# 32 KB of instruction cache, and this is the line that should never have needed
# writing. It is the best current candidate for why an S3 hub struggles at a job
# the classic hub has done for months.
#
# The ESP32-S3 can run 16 or 32 kB of I-cache and IDF defaults to 16. The classic
# ESP32 HAS NO SUCH SETTING -- components/esp_system/port/soc/esp32/ contains no
# Kconfig.cache at all, because its cache is fixed. So when this project was
# retargeted, there was nothing in the classic hub's config to inherit: the
# symbol appeared for the first time and silently took IDF's default, and this
# unit has been running half the instruction cache of the one it was copied
# from, ever since.
#
# That is the trap worth remembering, more than the setting. "The configuration
# started the same as the classic ESP32" is TRUE and is exactly the reason: a
# symbol that exists only on the new target cannot be inherited from the old
# one, and no diff of the tracked files will ever show it. It is the same shape
# as the LED pattern note below, which cost a false sync-fault reading.
#
# Why it should matter here specifically: this unit runs the FFT analysis, SBC
# decode, LED rendering and the WiFi driver, all out of flash through that
# cache, and a miss stalls the CPU on a SPI fetch. If those stalls land in the
# transmit path, TX buffers do not drain and sendto() starts refusing -- which
# is the fault. Corroborating evidence already in the logs: this is an LX7 with
# SIMD esp-dsp and should beat the classic hub's LX6 at the FFT, yet it reports
# analysis 3900/21000 us mean/max against an 11.6 ms frame period. A max of
# nearly two frame periods on the FASTER chip is not compute.
#
# Partly offset by flash at 80 MHz here against the classic hub's 40, which
# makes each miss cheaper. Evidently not enough.
#
# Costs 16 kB of heap: the unused half is given to the allocator at 16 kB, and
# is not at 32. Paid for by the line below.
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# Back to the IDF default of 32, from 64, and deliberately.
#
# 64 was the right guess when the transient looked like a buffer shortage: it
# cut tx-fail from 1016 to 251, then 78. But it never ended the transient, and
# it costs the heap this unit no longer has spare once the cache above takes its
# 16 kB back -- the minimum was already 34.7 kB with a 31.7 kB largest block.
#
# Returning it also makes the cache change a SINGLE-VARIABLE experiment. 32
# buffers with a 16 kB cache is exactly the configuration that measured tx-fail
# 1016; if 32 buffers with a 32 kB cache measures near zero, the cache was the
# cause and the buffer count never was. If the storm comes back, the cache is
# not the answer and 64 should return.
#
# INERT SINCE SPIRAM_TRY_ALLOCATE_WIFI_LWIP WENT ON, and kept only as the record
# of what this unit was tuned to. esp_wifi/Kconfig makes the DYNAMIC option
# `depends on !(SPIRAM_TRY_ALLOCATE_WIFI_LWIP && !SPIRAM_IGNORE_NOTFOUND)`, so
# enabling PSRAM for WiFi did not merely change where TX buffers come from -- it
# removed the dynamic choice entirely and dropped the build to STATIC, whose
# count is a different symbol with a default of 16. The line below reads as 32
# buffers and delivered 16.
#
# That is the confound the block at SPIRAM_TRY_ALLOCATE_WIFI_LWIP pinned three
# other symbols to avoid. It could not pin this one, because the dependency
# removes the option rather than changing its default -- so the PSRAM experiment
# silently also halved TX capacity, and the "BUFFER COUNT problem" fixed above
# came back with it.
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# The count that is actually in force, and the other half of the LOCAL_RING_BYTES
# change in main/hub.h.
#
# THE FAULT, 2026-08-12: tx-fail returned at 1-148 per 20 s window, ~1% of
# datagrams, and every one of them was ENOMEM -- measured, not inferred, by the
# errno tally tx_fail_note() now keeps. No EHOSTUNREACH at all, which is what
# rules out the ARP path client_joined() exists to protect and leaves buffer
# exhaustion as the whole of it.
#
# WHY NOW. It was hiding behind a bug. A refactor had local_play_task reading the
# ring 4 bytes at a time (sizeof on a pointer parameter), which starved the
# visualiser, which meant publish_frame() and publish_ml() sent NOTHING. Fixing
# the audio restored ~172 datagrams/s of publish traffic on top of ~50 of audio,
# and 16 static buffers does not absorb the bursts at 222/s. The pre-fix logs
# reading tx-fail 0 were measuring a hub with its analysis lane dead.
#
# WAS 26, NOW 32, and the reason 26 was the ceiling has gone away. Each static
# buffer is ~1.6 kB of INTERNAL memory; the pool had 7,760 bytes free, so 32
# would have needed 25.6 kB against the 16 kB freed by taking the ring from
# 64 kB to 48 kB. 26 was what that bought.
#
# The hub then stopped running its ML lane (DANCEFLOOR_ML_SOURCE_REMOTE below)
# and got ~24.9 kB of internal SRAM back -- measured, `MEM: internal` min going
# 6740 -> 22012 with the 26 -> 32 step already paid for out of it. That is what
# 32 is spent from, not the ring, which stays at 48 kB and keeps the feed-burst
# margin hub.h argues for.
#
# 32 WAS MEASURED, over 125 s, and it was enough for the DTIM burst that
# multicast analysis frames created: the hub read `tx-fail 0 (0 audio)` and the
# satellite `gaps 0`, where 26 gave `tx-fail 14-27 audio` per 20 s window. 40 was
# written here briefly and never reached a board, and the standing instruction
# was not to raise it on the strength of that.
#
# STILL 32, AND 40 IS NOT AVAILABLE. Tried 2026-08-15 and it does not boot:
#
#   assert failed: void visualiser_start() visualiser.cpp:1544 (pcm_stream)
#
# in a reboot loop. The reason is CONTIGUITY, not total free memory, and this is
# the trap worth carrying: pcm_stream is ONE allocation of STREAM_BYTES --
# FFT_N * CHANNELS * 2 * 8 = 32 kB (visualiser.cpp:123) -- and esp_wifi_init()
# takes these buffers out of internal DRAM BEFORE visualiser_start() asks for
# it. Eight more buffers is 12.8 kB off the largest free block, and the block
# stopped being 32 kB.
#
# THE NUMBER THAT MISLED, so nobody re-derives it: the HEALTH line's
# `internal 32604 free (min 30592, largest 22528)` looks like 12.8 kB of room.
# It is not. `min` is a TOTAL and this allocation needs a contiguous block; and
# `largest 22528` is measured AFTER pcm_stream already holds its 32 kB, so it
# describes what is left over, not what was available to it. Neither number can
# see this ceiling. Only a boot can.
#
# So the pool is not the lever here. The next one costs no memory at all: the
# rate the frame lane offers packets at, which TX_FRAME_PACE_US and
# TX_FRAME_BATCH in hub.h decide. See the note further down on what the
# multicast experiment measured and what removing it gave back.
#
# WHAT ARGUED FOR RAISING IT, kept because the fault is real and still open. A
# 45-minute soak that 125 s could not have shown
# (tools/soak/logs-soak-20260815-224002): tx-fail came back at 1-33 audio
# datagrams per 5 s window in roughly 30 of ~50 windows, and the satellites met
# each burst with a gap fill -- `gaps 14 (586 ms silence)` against
# `tx-fail 47 (33 audio)` in the same window -- which left their rings at
# `buffer 449 ms` and their phase at +268 ms. Both satellites stepped together
# and the hub did not move, which is what says the loss is here and not on the
# air or in a satellite.
#
# READ THE PREMISE THAT CHANGED. Everything above argues buffers over rate on the
# grounds that the transmit path "was broken for the first minute of a stream, on
# the step from idle to ~135 datagrams a second" -- a startup transient, which is
# exactly what a deeper queue absorbs. That premise no longer holds: the failures
# in this soak are spread evenly across all 45 minutes with no startup
# concentration (4 audio at 22:41, 33 at 22:52, 31 at 23:07, 14 at 23:24). A
# deeper queue absorbs a burst; it does not fix a burst that recurs. Even if the
# memory had been there, 40 was only ever expected to REDUCE this rather than end
# it. The bar is `tx-fail 0 (0 audio)` across a whole session.
#
# NOT the dynamic path either. ESP_WIFI_DYNAMIC_TX_BUFFER_NUM above is dead --
# the live sdkconfig has ESP_WIFI_TX_BUFFER_TYPE=0 -- and restoring the option
# means turning SPIRAM_TRY_ALLOCATE_WIFI_LWIP off, which pushes lwIP's buffers
# back into internal SRAM. WiFi TX buffers must be DMA-capable and come from
# internal heap either way, so that trade is likely net-negative here.
#
# 36 WAS MEASURED AND WORKED, and the instrument that measured it said how much
# was left: `analysis stream: 32768 bytes, largest internal block was 36864
# (31744 left)`. 36864 - 32769 is 4095 bytes, so 38 was the ceiling and 39 was
# not -- which is also why 40 boot-looped.
#
# MEMORY IS NO LONGER THE CEILING, and it turned out not to be the limit either.
# pcm_stream is allocated from PSRAM now (visualiser.cpp, MALLOC_CAP_SPIRAM),
# which is the one sanctioned way to move anything off internal on this board --
# SPIRAM_USE_CAPS_ALLOC means plain malloc never returns PSRAM, so a thing moves
# only by asking. That returned the whole 32 kB (measured: `analysis stream:
# 32768 bytes in PSRAM, largest internal block 31744 -> 31744`, and hub
# `internal min 37704` against 30592 before), AND it retired the 32 kB
# CONTIGUOUS requirement that made the earlier overshoot a reboot loop.
#
# 48 WAS THEN TRIED, AND IT IS WORSE THAN 36. This is the finding worth keeping,
# because every step in this file's history moved the number UP -- 16, 26, 32 --
# and nobody had looked for the top. Per hour, three soaks:
#
#   buffers          32        36        48
#   hub windows w/ tx-fail  23%      4.2%     14.7%
#   sat gaps/h              92        16        35
#   anchors-refused/h      139        15       278
#   dma-starve/h           714       113       900
#   ring-full/h             15         0        21
#   pad frames/h         31500      9400     24300
#
# 48 is worse than 32 on several of those. Memory was fine throughout
# (alloc-fail 0, internal min 37704), so this is not a resource fault.
#
# WHY MORE IS WORSE: bufferbloat. These buffers do not increase the rate the
# radio drains them -- group-addressed frames leave on the DTIM beacon and
# nothing here changes that -- so a deeper pool only lets more packets QUEUE, and
# they arrive late instead of not arriving. Audio has a hard deadline: every
# chunk carries play_at, LEAD_US = 200 ms ahead, and a satellite that gets a
# packet after its instant has already filled the gap with silence and moved on.
# A late packet is worth less than a dropped one. `anchors-refused` is the
# counter that says so directly -- it fires when an arriving packet's play_at has
# passed -- and at 48 it is 278/h against 15/h at 36.
#
# So: 36, and the ceiling on this number is BEHAVIOURAL, not memory. Anything
# that raises it again has to answer anchors-refused, not free bytes.
#
# The PSRAM move stays regardless. It costs nothing measurable -- vis
# `cost: analysis 1328/4406 us` against a 1358/4287 baseline, and the hub's own
# audio path reads dma-starve 0, short-reads 0, underruns 0 -- and the headroom
# it buys is what makes the next experiment a free choice rather than a fight
# with the allocator. It is simply not headroom that should be spent here.
#
# CAVEAT ON ATTRIBUTION: the 48 run also carried the PSRAM move, so strictly it
# is 48+PSRAM against 36+internal. The evidence points at the count -- analysis
# cost did not move, the hub's own playback is spotless, and cache jitter would
# have hit that first -- but the clean comparison is 36+PSRAM, which is what this
# build now is.
#
# Falsified by tx-fail itself, which is the counter CACHE_TX_BUFFER_NUM is pinned
# to 0 further down to keep honest.
#
# 38, +2, 2026-08-17: a couple, deliberately, and not a lunge back toward 48.
# The same soak that produced the table above caught the actual fault at the
# source -- analysis-frame bursts crowding the pool until the AUDIO's sendto
# came back ENOMEM at the exact audible-glitch moments -- and the fix that
# ships with this change is the frame lane's proactive pace (TX_FRAME_PACE_US
# in hub.h), which stops the burst from forming at all. The +2 is the other
# half of the same repair: two more buffers of margin for the moment a burst
# does begin, cheap now that the burst-former is gated, and far enough below
# 48's bufferbloat that the anchors-refused finding is not in play. Memory
# headroom is not the question (PSRAM move above): internal min 37704 leaves
# room for far more than two.
#
# The re-measure that matters if this ever moves again is the table's, not a
# free-bytes one: 38 has to answer anchors-refused and sat gaps/h against the
# 36 row above. If 38 reads like 48 did, come back to 36 -- the pace gate
# should already have carried the repair on its own.
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=38

