apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# The three below are PINNED AT THEIR CURRENT VALUES, not tuned. Enabling the
# symbol above would otherwise move all three, and this has to stay a single-
# variable experiment for the same reason the TX buffer count was returned to 32
# further up: the only question being asked here is WHERE WiFi memory comes
# from, and an answer confounded by three other changes is not an answer.
#
# STATIC_RX_BUFFER_NUM would go 10 -> 16, RX_BA_WIN 6 -> 16 (both in
# esp_wifi/Kconfig, defaulted per SPIRAM_TRY_ALLOCATE_WIFI_LWIP). The BA window
# matters on the air, not just in RAM: the satellite is built with 6, and moving
# only this end changes what the two negotiate.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_RX_BA_WIN=6

# CACHE_TX_BUFFER_NUM only exists when the symbol above is set, and defaults to
# 32. It queues upper-layer packets in PSRAM when no static TX buffer is free,
# instead of rejecting them.
#
# 16, 2026-08-23, AS A MEASUREMENT AND NOT AS A FIX. Read the whole of this
# before reading the next soak, because the expected result is NOT "tx-fail
# goes to zero" and a run that produces it has not succeeded.
#
# WHAT THE 15:56 SOAK ESTABLISHED. 1,180 audio refusals in 7.19 h, every one of
# them ENOMEM. Nothing on the hub predicted them: pivoting all 7,696 status
# windows, ring depth, lead-min, phase, rssi-min and churn are the same in a
# refusing window as in a clean one. Only the consequences move. 33 of 55
# starvation bins hit BOTH satellites at once, which is the medium or this
# radio rather than either station. The frame lane was in flight for 1% of
# refusals, so the pace gate is already doing its job.
#
# WHY A DEEPER QUEUE IS NOT EXPECTED TO HELP, stated so the run can falsify it.
# The pool is 38 buffers against ~130 datagrams/s, i.e. ~292 ms deep, so a
# refusal means the medium was gone for 292 ms PLUS the refusal stretch. Those
# stretches ran p50 63 ms, p90 288 ms, p99 926 ms -- so the shortest stall that
# refuses anything is already ~355 ms, against a LEAD_US of 350 ms. A packet
# this queue holds through one of them arrives with no lead left and is
# unplayable when it emerges. The queue converts a refused packet into a late
# one, and both are silence.
#
# SO WHAT IS BEING TESTED IS THAT SENTENCE, not the queue. Read in this order:
#   1. air-gap-max / txdone-fail (new this change, see tx_done_cb() in net.c) --
#      these are stamped when the RADIO finishes a frame, so unlike tx-fail,
#      fanout-gap-max and lead-min they cannot be hidden by this queue. If
#      air-gap-max still shows 355 ms-1.2 s silences, the stall is real and the
#      queue only moved where it is counted.
#   2. the SATELLITES' gap-max, lead-min and starved ms. These are the room's
#      own reading and this queue cannot touch them either. If starved does not
#      fall, the queue bought nothing however quiet tx-fail went.
#   3. tx-fail LAST, and only to confirm it fell. On its own it now means
#      nothing: absorbing the evidence is exactly what the queue does.
#
# 16 rather than the default 32 because 16/130 s is ~123 ms of added delay,
# inside what a 350 ms lead can absorb; 32 is ~246 ms and would spend most of
# the lead on its own. A previous run at 32 is on record as not removing
# tx-fail, which is consistent with all of the above.
#
# If air-gap-max confirms the stalls, the next question is upstream of this
# file -- the interferer on the chosen channel, or the driver's own dequeue --
# and this goes back to 0 rather than staying on as a blindfold.
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16

# Forward this unit's logs and HEALTH snapshots over the sync socket to a
# laptop collector (see CONFIG_DANCEFLOOR_WIFI_LOGS). Bench only, and now OFF by
# default -- which is what the line above always said and what this setting
# contradicted. The Kconfig default is n; these two files were the only thing
# turning it on.
#
# Off because it is not free on the resource this hub is short of. Every
# ESP_LOG line becomes a datagram, and the hub relays every satellite's as well,
# so it is bursty unicast traffic drawn from the same static TX buffer pool that
# the audio and the analysis frames are competing for -- and a burst of log
# lines is exactly what a fault produces, so the instrument gets loudest at the
# moment it can least afford to. The satellite's own Kconfig help records the
# sharper version of this: a blocking log write in the receive path "starves the
# UDP mailbox and causes the very loss it was logging".
#
# WHAT TURNING IT OFF COSTS: tools/log_collector/collect.py stops working, and a
# satellite's log is then only readable on that satellite's own serial port.
# Turn it back on -- here and on every satellite, they must agree -- for any run
# where centralised capture is worth the airtime. It compiles out entirely when
# unset: no shipper task, no queue, no wifi_log symbols.
CONFIG_DANCEFLOOR_WIFI_LOGS=n

# How many DHCP leases the SoftAP can hand out. IDF's default is 8, which was
# invisible while MAX_CLIENTS was also 8: it agreed by coincidence rather than
# by construction, and nothing named it.
#
# It is the THIRD of three limits that decide how many satellites a floor can
# hold, and the only one whose failure is quiet. The other two -- MAX_CLIENTS
# and wifi_config.ap.max_connection -- refuse a satellite at association, which
# it notices and reports. Running out of leases lets it associate and then gives
# it no address, so the hub sees a station that joined and never probed, and
# n_sta_nolease is the only tell. Kept at MAX_CLIENTS so the three move
# together.
CONFIG_LWIP_DHCPS_MAX_STATION_NUM=15

# THE HUB RUNS NO PLUGGABLE ANALYSERS. The setting that says so is now
# DANCEFLOOR_ML, which replaced the DANCEFLOOR_ML_SOURCE choice when results
# stopped being distributed; DANCEFLOOR_PUBLISH_ML went at the same time.
#
# Pinned here rather than left to the Kconfig default of n, for the reason the
# old ML_SOURCE line was pinned: sdkconfig is gitignored, this hub's measurements
# were all taken with the lane off, and a clone that quietly turned it on would
# invalidate them. The default agrees today -- that is not a reason to rely on it.
#
# What it cost the hub when the choice existed: nothing it was using. The lane's
# two analysers are ZcrRms and Mood; the periodic log read `slow 0/0 us` and
# `results N+0` for the whole of every run captured -- the slow lane produced
# nothing at all -- and `ml-throt` showed ~77 of the fast one's results a second
# being computed and thrown away against a 100 ms publish period.
#
# What it bought: ~25 kB of INTERNAL SRAM, the pool the WiFi static TX buffers
# come from and the binding constraint on this board. The lane's stream buffer
# alone was 12.8 kB (16 kHz x 400 ms x 2 B), plus a 4 kB mlan stack and its TCB,
# plus ~6.3 kB of resampler table and decimation buffer. None of it could live in
# PSRAM: SPIRAM_USE_CAPS_ALLOC means plain malloc and every task stack are
# internal.
#
# The lane is on its way out entirely: once the analysers read the quantised
# spectrum every unit already receives in MSG_FRAME, they need no audio, no
# resampler and no task, which is what makes running them on a satellite
# practical. Until then this line is what keeps them off here.
CONFIG_DANCEFLOOR_ML=n

# DANCEFLOOR_MCAST_FRAMES WAS SET HERE, sending the analysis frames to the same
# multicast group as the audio. Both it and DANCEFLOOR_AUDIO_MCAST are gone --
# every lane is unicast to the client list now -- and the measurements are kept
# because they are what the transmit-buffer count above is still spent on.
#
# The question was narrow: does a 32-buffer pool absorb a DTIM burst of ~15
# group frames, where 26 could not? It did.
#
#   frames unicast, 26 buffers   tx-fail 0        sat gaps 0.17/s
#   frames MCAST,   26 buffers   tx-fail 14-27    sat gaps 1.1/s
#   frames MCAST,   32 buffers   tx-fail 0        sat gaps 0 in 125 s
#
# The 32-buffer run in full:
#
#   hub  tx-fail 0 (0 audio) | cong-skip 0 | 50 pkts/s | frames mcast
#   sat  gaps 0 (0 short, 0 too big) ring-full 0        -- at 65 s AND 125 s
#   sat  leds remote hop 512 (rx 5012 -> 10181, bad 0)  -- 86.1 frames/s, none bad
#
# What it bought was the only thing that made the hub's transmit rate FLAT in
# speaker count: 50 + 96xN packets/s became ~146, whatever N is. At fifteen
# satellites that is ~316/s against ~1490/s. Removing multicast gives that back:
# the rate is 50 + 96xN again, and the buffer count above is what absorbs it.
#
# STILL ONLY MEASURED AT TWO SATELLITES, and that matters more now than it did
# while the frames were flat in N. Nothing has put more than two on the floor,
# and the probe traffic scaled with N even then.
